# IndexStreamLine Properties

---
The IndexStreamLine type exposes the following members.
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity. (Inherited from IndexStream)
Top
#### Reference
IndexStreamLine Class
Autodesk.Revit.DB.DirectContext3D Namespace